{"count":5083,"next":"http://zerocool.mgruppi.me:8000/newsArticles/?content__contains=&format=json&page=2&published_at=&published_at__gt=2020-12-31&published_at__lt=&source=&title=&title__contains=","previous":null,"results":[{"_id":"activistpost--2020-12-31--2020:  The Year In Which Comforting American Myths Were Ravaged","title":"2020:  The Year In Which Comforting American Myths Were Ravaged","content":"Thanks in large part to Covid lockdowns, this year has left vast wreckage in its wake, with ten million jobs lost, more than 100,000 businesses and dozens of national chains bankrupted or closed. Up to 40 million people could face eviction in the coming months for failing to pay rent, and Americans report that their mental health is at record low levels. But the casualty list for 2020 must also include many of the political myths that shape Americans’ lives.\n\nPerhaps the biggest myth to die this year was that Americans’ constitutional rights are safeguarded by the Bill of Rights. After the Covid-19 pandemic began, governors in state after state effectively placed scores of millions of citizens under house arrest – dictates that former Attorney General Bill Barr aptly compared to “the greatest intrusion on civil liberties” since the end of slavery. Politicians and government officials merely had to issue decrees, which were endlessly amended, in order to destroy citizens’ freedom of movement, freedom of association, and freedom of choice in daily life. Los Angeles earlier this month banned almost all walking and bicycling in the city, ordering four million people to “to remain in their homes” in a futile effort to banish a virus.\n\nThe Rule of Law is another myth impaled by 2020’s dire developments. Courts have repeatedly struck down sweeping restrictions. Federal judge William Stickman IV invalidated some of Pennsylvania’s restrictions in a September ruling: “Broad population-wide lockdowns are such a dramatic inversion of the concept of liberty in a free society as to be nearly presumptively unconstitutional.” After the Michigan Supreme Court effectively labeled Governor Gretchen Whitmer a lawless dictator, she responded by issuing “new COVID-19 emergency orders that are nearly identical to her invalidated emergency orders,” as the Mackinac Center noted. How many governors and mayors have you seen on the television news being led away in handcuffs after their arrest for violating citizens’ rights this year? None.\n\nAnother myth that 2020 obliterated was the notion that politicians spending more than a hundred billion dollars every year for science and public health would keep Americans safe.\n\nThe Centers for Disease Control utterly botched the initial testing regime, sending out bogus tests to state and local health departments and taking a month and a half to do what the Thai government achieved in one day. The Food and Drug Administration helped turn the coronavirus from a deadly peril into a national catastrophe. Long after foreign nations had been ravaged and many cases had been detected in America, the FDA continued blocking private testing. The FDA continued forcing the nation’s most innovative firms to submit to its command-and-control approach, notwithstanding the pandemic.\n\nBecome an Activist Post Patron for just $1 per month at Patreon.\n\nThe benevolence and compassion of public school teachers was another myth that 2020 obliterated. Teacher unions helped barricade school doors the same way that segregationist governors in the 1950s and 1960s refused to obey federal court orders to admit black students. The Chicago Teachers Union proclaimed: “The push to reopen schools is based in sexism, racism, and misogyny.”\n\nBlack and Hispanic students suffered much larger learning losses due to school shutdowns, leading former Education Secretary John King to warn of a “lost generation of students.” Despite a deluge of studies that showed that schools posed little risk of fueling the pandemic, teachers insisted that they were entitled to both their salaries and to stay at home as long as they considered necessary.\n\nThis was part of the collapse of the broader myth that the rulers and ruled have common interests. Among other splits, the response to the pandemic divided Americans into those who work for a living, and those who “work” for the government. Government employees in most states and at the federal level have been the Untouchables, continuing to draw full pay even when they were no longer even required to show up for work. One exception to this trend is government tax collectors, who continue commandeering as much as ever from citizens and property owners regardless of the collapse in public services in many places this year.\n\nAnother myth that perished in 2020 was that social media and the Internet could be a powerful propellant of free information. Instead, the biggest players pulled the most strings to suppress criticisms or dissent from the latest Covid policies promulgated by officialdom. On March 18, Twitter announced that, in response to Covid-19, it would ban tweets guilty of “denial of expert guidance” or “misleading content purporting to be from experts or authorities.”\n\nThe World Health Organization initially overestimated the Covid fatality rate by 50-fold but they remain Twitter-approved. Facebook recently launched far more aggressive policies, including directly contacting anyone who liked or commented on a piece that was later ruled erroneous by Facebook guardians and is refusing any ads that discourages people from getting vaccinations. Will they ban WHO’s chief scientist Soumya Swaminathan for declaring on Monday that there was “no evidence to be confident [vaccine] shots prevent transmission” of Covid? Google sought to suppress any doubts about lockdowns: “Most users in English-speaking countries, when they google ‘Great Barrington Declaration’, will not be directed to the declaration itself but to articles that are critical of the declaration,” a Spiked-Online analysis noted.\n\nThis year’s presidential election put a helluva dent in the credo that politicians rule with the “consent of the governed.” The pandemic provided the pretext to radically change voting procedures, spurring 65 million mostly unverified mail-in ballots. The New York Times warned in 2012 that “fraud in voting by mail is… vastly more prevalent than the in-person voting fraud that has attracted far more attention.” Many states solved that problem by “defining down fraud” and expunging the verification procedures previously used to routinely invalidate 20% or more of mailed-in ballots. The controversies around mail-in ballots, questionable software, ballot harvesting and other practices mean that a record number of Americans will doubt Joe Biden’s legitimacy even before he takes his oath of office.\n\nPerhaps the saddest casualty of 2020 is the myth that average Americans cherish their personal freedom. Politicians continually shifted the rationale for lockdowns – from flattening the curve, to ending “community spread,” to reducing cases to near zero. Regardless of the proclaimed rationale, most people submitted without a fight, and usually without even a whimper. Politicians and bureaucrats fanned mass fears which quickly ripened into hatred of anyone who did not comply with the latest edict.\n\nStates and cities across the country set up snitch lines that were soon deluged with complaints of people outside without a mask, meeting friends, or having more visitors in their homes than could fit in a phone booth. Many, if not most, people quickly acquiesced to the “new normal” where any government hack who recited the phrase “science and data” became entitled to rule their lives with an iron fist.\n\nAs the Harvard International Review warned, “The very methods that liberal democracies are currently using to effectively fight the virus are the same tactics that authoritarian leaders use to dominate their people. The tools that have been temporarily deployed in the fight against a once-in-a-lifetime disease may become permanent.” That was written on May 23, more than 15 million Covid cases ago – proof of the failure of lockdowns and pervasive restrictions to make Covid-19 vanish. But the miserable batting average of officialdom will vanish into the Memory Hole if politicians launch a campaign to make Covid vaccinations mandatory, complete with boundless vilification of anyone who balks at the injection.\n\nPerhaps it has long been a myth that we live in a self-governing republic rather than a Leviathan Democracy where citizens merely make cameo appearances every few years at the voting booth. It is still possible that the catastrophic and pointless losses imposed by Covid crackdowns will finally awaken enough people to their growing subjugation. But the most dangerous myth is that Americans will finally become safe after they cease making any efforts to leash their rulers.\n\nJames Bovard is the author of ten books, including Public Policy Hooligan, Attention Deficit Democracy, The Bush Betrayal, and Lost Rights: The Destruction of American Liberty. He has written for the New York Times, Wall Street Journal, Playboy, Washington Post, New Republic, Reader’s Digest, and many other publications. He is a member of the USA Today Board of Contributors, a frequent contributor to The Hill, and a contributing editor for American Conservative\n\nSubscribe to Activist Post for truth, peace, and freedom news. Send resources to the front lines of peace and freedom HERE! Follow us on SoMee, HIVE, Parler, Flote, Minds, MeWe, Twitter and Gab.\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.","source":"activistpost","published_at":"2020-12-31T00:12:00-05:00","url":"https://www.activistpost.com/2020/12/2020-the-year-in-which-comforting-american-myths-were-ravaged.html"},{"_id":"activistpost--2020-12-31--Boston Dynamics’ Robots Learn How To Dance In Creepy New Video","title":"Boston Dynamics’ Robots Learn How To Dance In Creepy New Video","content":"On Tuesday, Boston Dynamics uploaded a video to YouTube of their robots creepily dancing to The Contours’ Do You Love Me.\n\nThe video shows Atlas, Spot, and Handle – Boston Dynamics’ top robots, performing moves choreographed to the music.\n\nThe dance starts with Atlas, a bipedal humanoid robot, dancing to the music, and before you know it, another Atlas joins in. Then out of nowhere, robodog Spot hops in and starts dancing with the crew.\n\nAbout halfway through the video, Handle, a warehouse robot, slides into the frame – as everyone is getting down with the catchy tune.\n\nBecome an Activist Post Patron for just $1 per month at Patreon.\n\nTesla’s Elon Musk chimed in this morning after he watched the video. He tweeted:\n\nThe robots are impressive. They dance with remarkable accuracy, performing moves that only baby boomers would know how to do.\n\nThis is not the first time that the robotics company has demonstrated the dance capabilities of its machines. In 2018, it published a video titled “UpTown Spot,” where Spot got down with some funk.\n\nMaybe the elaborate dance party was celebrating the recent acquisition of Boston Dynamics by Hyundai.\n\n“This is the beginning of The Terminator,” one commentator said on YouTube.\n\nAnother said, “Only need to get a human skin then there goes backup dancers job.. welcome to the unemployed.”\n\nAlso Read Activist Post’s Chronicle: The Evolution of Humanoid Robots\n\nSubscribe to Activist Post for truth, peace, and freedom news. Send resources to the front lines of peace and freedom HERE! Follow us on SoMee, HIVE, Parler, Flote, Minds, MeWe, Twitter and Gab.\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.","source":"activistpost","published_at":"2020-12-31T00:12:00-05:00","url":"https://www.activistpost.com/2020/12/boston-dynamics-robots-learn-how-to-dance-in-creepy-new-video.html"},{"_id":"aljazeera--2020-12-31--Trump, McConnell division grows as Senate poised to override veto","title":"Trump, McConnell division grows as Senate poised to override veto","content":"US Senator Mitch McConnell has not been to the White House, which is experiencing a COVID-19 outbreak, for two months.","source":"aljazeera","published_at":"2020-12-31T01:12:00-05:00","url":"https://www.aljazeera.com/news/2020/12/31/trump-mcconnell-division-grows-as-senate-poised-to-override-veto"},{"_id":"aljazeera--2020-12-31--Vietnamese pick up the pieces after 2020’s relentless storms","title":"Vietnamese pick up the pieces after 2020’s relentless storms","content":"Climate change increases the risk to hard-hit central provinces, but few want to leave the only home they know.\n\nHue, Vietnam – Before floodwater inundated half their living room one night during the storm season this year, the Trans put their most valuable possessions – their TV and refrigerator – in the attic and told their two daughters to take refuge there.\n\nTran Nhu Hong, 23, and her 18-year-old sister, who do not know how to swim, survived the storms – the worst her generation had ever experienced and the worst her parents had seen in decades.\n\nA neighbour was not so fortunate. The 19-year-old student was swept away in the floods after the vehicle she was travelling in was tipped over by the force of the water – on the same route the two young women usually take.\n\n“Shortly after the water retreated, I went on that route and the vehicle was still there and had not yet been pulled out (of the mud),” Hong said. “I don’t dare to go on that route late at night any more.”\n\nAcross central Vietnam, cascading floods from October onward inundated the living and the dead, as record rainfall submerged towns and cemeteries. Authorities said earlier this month that the typhoons, which they referred to as “abnormal”, cost the Southeast Asian country 30 trillion dong ($1.3bn) in damage and killed at least 192 people – a death toll more than five times higher than the 35 COVID-19 deaths Vietnam recorded this year.\n\n“In general, it is well-established that rainfall from typhoons is increasing due to climate change, both from observations and from models,” said Geert Jan van Oldenborgh, lead climate scientist at the Red Cross Climate Center and World Weather Attribution, whose team is conducting a study on the role of climate change in the recent floods and typhoons in central Vietnam.\n\nWith 70 percent of the population living in coastal areas and low-lying deltas, Vietnam is highly exposed to riverine and coastal flooding and is also one of the world’s most vulnerable countries to the effects of climate change.\n\n“There is even more damage after the floods,” Hong said, driving by rice fields made inlets because of the storms and floods in her hometown in Thua Thien Hue Province.\n\nWhen the water retreated, it took crops with it, leaving behind scarred earth. Many farming families in central Vietnam count on rice, various other crops and cattle for income, especially as the Lunar New Year celebration, known as Tet, nears.\n\nTet is usually when Vietnamese shop for new clothes, gifts and appliances to welcome a new, fulfilling beginning; but with their homes and means of living ravaged by violent storms, severe floods and devastating landslides, Tet, which will take place in February, is likely to be tinged with sadness.\n\nHong’s parents are still recovering from the wounds and infections they got from wading through hip-high flood water for extended periods, and have yet to find jobs as construction workers due to the double burden of COVID-19 and the recent natural disasters.\n\nAn aerial view of the city of Hoi An, a UNESCO World Heritage Site, after it was flooded in the aftermath of Typhoon Molave on October 30 [File: Manan Vatsyayana/AFP] \n\n Ichiro Sato, senior associate with the Climate Program and Sustainable Finance Center at US-based think tank World Resources Institute, says central Vietnam was battling extreme weather events long before climate change started to take effect.\n\n“If governments have not been well-prepared even for the conventional risk of weather-related disasters that existed before climate change – and I am afraid that is the case for Central Vietnam – then there are so many things they have to work on before worrying about the additional risk of climate change,” Sato said, adding that unregulated urbanisation and economic growth may increase vulnerability to weather-related disasters in places like Vietnam.\n\nThe country typically endures between five and six storms and about three tropical depressions a year, according to the National Center for Hydro-Meteorological Forecasting, but in 2020 a total of at least 14 ravaged the country. Seven consecutive tropical storms and cyclones hit the central region between October and mid-November.\n\nAccording to the UN, an estimated 7.7 million people in nine provinces, including 2.5 million children, were affected – with hundreds of thousands of houses flooded, damaged or destroyed.\n\n“There is no doubt that children are those most affected by natural disasters,” Rana Flowers, UNICEF representative in Vietnam, told Al Jazeera, adding that families’ ability to secure nutritious food for their children had already suffered as a result of the pandemic.\n\nAn estimated 375,000 people were sent to evacuation centres during the storms and floods, including about 90,000 children, according to Flowers.\n\n“Many of the evacuation sites were overcrowded, did not have access to sufficient water and sanitation and healthcare, and lacked appropriate management needed to prevent the spread of COVID-19 and to mitigate protection risks especially for women and children,’’ Flowers said, adding that the situation severely affected the mental health and psychosocial wellbeing of children.\n\nA study brief published in August by the US-based Society for Research in Child Development showed that children may suffer longer-term physical and psychological deficits than adults, including difficulty sleeping or concentrating and losing interest in their usual activities – chronic mental health symptoms have been observed among children as long as four years after a disaster.\n\nA woman carries food through the submerged streets of Hue in central Vietnam [File: Manan Vatsyana/AFP] “In the long run, to be sustainable, the Vietnamese government should invest more to strengthen mental health services for children and their families, looking at the nationwide system and also building the workforce,’’ Flowers said.\n\nDeforestation, which affects the ability of the land to retain water, also contributed to the flooding and a series of severe landslides during the stormy season, Deputy Prime Minister Trinh Dinh Dung said at a legislative National Assembly meeting last month.\n\nBetween 2002 and 2019, Vietnam lost 657,000 hectares (1.6 million acres) of primary forest – 23 percent of its total tree-cover loss according to data from international monitoring service Global Forest Watch. About 50 percent of all tree-cover loss between 2001 and 2019 took place in 11 of the country’s 63 provinces – eight of them in central Vietnam, it said.\n\nThe devastating landslides and flooding have prompted concerns about deforestation caused by the construction of hydropower plants in forests.\n\nAs of 2018, there were 385 dams in operation, with an additional 143 under construction, according to the Ministry of Industry and Trade. Earlier this month, the minister acknowledged the increased evidence of the loss of watershed forests and vegetation, as well as a loss of soil adhesion, as a result of the developments.\n\nA landslide in central Vietnam amid the storms that have pummelled the country this year [Sen Nguyen/Al Jazeera] Prime Minister Nguyen Xuan Phuc suggested last month at a legislative National Assembly meeting that Vietnam target planting one billion trees in the next five years, although he did not elaborate on how the initiative would be executed.\n\nThe government has also announced sustainable and long-term missions to cope with storms in central Vietnam, including upgrading climate-change adaptation scenarios and relocating people in areas at risk of landslide and flooding.\n\nFor those who have been living in the area for generations, like the parents of 21-year-old university student Le Thi Thuyen, leaving their storm-battered homes seems unfathomable.\n\n“We can be accustomed to annual storms but whenever they come, we are still worried,” said Thuyen, a native of Quang Binh, one of the hardest-hit provinces in the central region.\n\nThuyen, who left for Ho Chi Minh City to study and is currently an intern at a non-governmental organisation in Vietnam’s biggest city, called her parents and siblings back home every day when the storms were pounding their commune, flooding and isolating homes in low-lying areas.\n\nTears welled up in her eyes when she thought of her 12-year-old brother who does not know how to swim.\n\nCemeteries were inundated as floodwaters rose in central Vietnam [Sen Nguyen/Al Jazeera] “I read news about kids who got swept away by the flood and I was really worried about my brother,” the 21-year-old said.\n\nThuyen’s parents, who make a living from agriculture and working on other people’s farms, have already been struggling this year because of the pandemic – and the storm season has created more problems, destroying their crops, and fish. It also meant weeks when there were no jobs to be found.\n\n“Tet this year won’t be as fulfilling as others for us,” Thuyen said. “This time, it won’t be my parents supporting me, but I will be supporting them with what I can.”","source":"aljazeera","published_at":"2020-12-31T00:12:00-05:00","url":"https://www.aljazeera.com/news/2020/12/31/vietnam-storms"},{"_id":"aljazeera--2020-12-31--Second Indigenous activist killed in Honduras this week","title":"Second Indigenous activist killed in Honduras this week","content":"Felix Vasquez, a defender of environmental and human rights, died on Saturday after an attack in central Honduras.","source":"aljazeera","published_at":"2020-12-31T00:12:00-05:00","url":"https://www.aljazeera.com/news/2020/12/31/honduras-sees-second-indigenous-activist-killed-in-in-past-week"},{"_id":"alternet--2020-12-31--How Trump turned himself into a historic loser","title":"How Trump turned himself into a historic loser","content":"It is obvious by now that President Donald Trump is a narcissist desperately afraid of being thought of as a \"loser.\" This is why he has gone to such incredible lengths to deny the results of the 2020 election: A man who regularly used the epithet \"loser\" as a go-to insult long before taking office will now be remembered as one of only a handful of sitting presidents to seek another term and be rebuffed by the American people.\n\nStill, 77% of Republicans claim (whether sincerely or in bad faith) that President-elect Joe Biden didn't legitimately win. While America has had other one-term presidents, it has never had either a one-term president or a large group of that one-term president's supporters react with such cringe-inducing, democracy-defying petulance. Being defeated is embarrassing, to be sure, but nothing is more shameful than reacting to a defeat by throwing a giant temper tantrum and lying about the other side cheating.\n\nFor that, Trump and those backing his ego-salving coup attempt are in a category of their own in American history —making them historic losers. Let's briefly look at how America's other one-term presidents have reacted to their electoral defeats.\n\nBefore Trump, America had ten one-term presidents: John Adams, John Q. Adams, Martin Van Buren, Grover Cleveland, Benjamin Harrison, William H. Taft, Herbert Hoover, Gerald Ford, Jimmy Carter and George H. W. Bush. The initial Adams is the most instructive of this group because he was the first president who had to give up power reluctantly. (His predecessor and America's first president, George Washington, famously did not seek a third term and was eager to relinquish power at the end of his second.) Adams was extremely bitter about losing to Thomas Jefferson in the 1800 election and, to prove that point, refused to attend his successor's inauguration. At the same time, Adams made it clear that democracy could only work if those in power bowed to the will of the people, regardless of their personal wishes. Jefferson later praised Adams' peaceful transfer of power as the \"revolution of 1800\" because it established that in America the government is controlled \"by the rational and peaceable instrument of reform, the suffrage of the people.\"\n\nThis isn't to say that Adams didn't do what he could to figuratively kick Jefferson and his Democratic-Republican supporters in the shins, most notably by appointing a number of Federalists (his party) to judicial offices on his way out the door. (The most famous of the bunch was John Marshall, who Adams chose as chief justice of the Supreme Court.) Other one-term presidents have followed his example, trying to shore up their legacies and/or engaging in vindictive trickery while still accepting the voters' verdict. Like his father, John Q. Adams refused to attend the inauguration of his successor, Andrew Jackson.\n\nMartin Van Buren took solace in the fact that he actually won more votes during his reelection campaign in 1840 than when he had been first elected in 1836 (as in 2020, that advantage was offset by a massive increase in voter turnout, most of which benefited his opponent William H. Harrison) and immediately began planning another presidential run in 1844, although he ultimately failed in that effort.\n\nIn 1888 Grover Cleveland actually won the popular vote but still he lost his reelection campaign — the only sitting president to whom this has happened — and like Van Buren gracefully accepted his defeat and immediately began planning for the next campaign, which he actually won. (Cleveland's reelection in 1892 made him the only president to serve two non-consecutive terms.)\n\nSome one-term presidents simply moved on with their lives. Benjamin Harrison's wife died of tuberculosis two weeks before Election Day 1892, and he was so devastated that he focused on finding a healthy way to grieve and develop a post-political career when he learned he hadn't been reelected. William H. Taft, by contrast, felt acutely humiliated by being the only sitting president to do worse than a third-party candidate — he received 23.2% of the popular vote, less than third-party candidate and former President Theodore Roosevelt, and only won the electoral votes of Utah and Vermont — but threw himself into a new job as a professor at Yale Law School and worked closely with his successor, President Woodrow Wilson, both during and after the transition. Indeed, Taft was so highly regarded as an ex-president that he was eventually appointed as chief justice to the Supreme Court, making him the only American to serve as both a president and a Supreme Court judge.\n\nHerbert Hoover is one of the less impressive names on this list. After losing in a landslide to Franklin D. Roosevelt in the 1932 election because of the Great Depression, Hoover engaged in petty squabbles with Roosevelt's transition team over economic policy, as Hoover was convinced that Roosevelt was a lightweight and completely unqualified to steer America out of the crisis. The bitterness led to a number of petty swipes taken during and after Hoover's presidency, and Hoover regularly fought his successor's policies and accused him of being a tyrant, but never tried to defy the 1932 election results.\n\nGerald Ford is a unique case because he was never elected either president or vice president; he reached the latter office because Vice President Spiro Agnew resigned due to a bribery scandal and the former after President Richard Nixon resigned due to the Watergate scandal. Despite coming shockingly close to winning a term in his own right in the 1976 election, Ford was graceful in defeat and worked so closely with incoming President Jimmy Carter that the successor took the unusual step of praising Ford in his inaugural address.\n\nCarter, by contrast, was less than thrilled when he lost in an unexpected landslide to Ronald Reagan in the 1980 election, especially since Reagan was a far right-wing candidate whose views were anathema to the center-left Carter. Yet Carter still worked with his successor, even successfully negotiating the release of 52 Americans who were being held hostage in Iran during the transition between their two administrations despite knowing Reagan would receive credit for their release.\n\nGeorge H. W. Bush, for his part, anticipated that he would lose to Bill Clinton in the 1992 election, given his poor polls and the underwhelming economy. His deep disappointment did not stop him from gracefully working with his successor, however, and Clinton repaid the favor by striking Iraq after learning that Iraqi dictator Saddam Hussein had plotted to assassinate the former president. Bush and Clinton eventually became very close friends.\n\nNow compare all of this — the good, the bad and the ugly — with Trump's behavior.\n\nSince 2016, Trump has insisted that if he runs in an election and does not win, it is because the other side cheated. He did this during his 2016 bid for the Republican presidential nomination when he lost the Iowa caucuses to Sen. Ted Cruz of Texas and, later, repeatedly claimed that if he lost to Democratic nominee Hillary Clinton it would be because the election was \"rigged\" and that he would only accept the results \"if I win.\" After Trump defeated Clinton in the electoral college (coincidentally by the same margin, 306 to 232, by which he lost to Biden in 2020), he obsessed over the fact that he lost the popular vote and falsely claimed that he had actually won it, creating a voter fraud commission to prove his claim that eventually had to be disbanded because no such evidence existed.\n\nAnd that was just about the 2016 election. Because he knew that Democrats were more likely than Republicans to vote by mail due to the COVID-19 pandemic, Trump tried to preemptively discredit mail-in votes with false claims that they were prone to fraud; these were rejected in court, but that did not stop Trump from trying to cripple the Post Office so that \"they can't have universal mail-in voting.\" As in 2016, Trump also repeatedly said that the only way he could lose is if the Democrats stole the election, telling Fox News' Chris Wallace that he would not promise to accept the 2020 election results if they went against him, admitting that he is not a \"good loser\" and claiming that \"mail-in voting is going to rig the election.\" This paved the way for him to prematurely claim victory on Election Night because in-person votes were generally counted first and made it look like he had a lead, and then falsely claim that there were \"vote dumps\" as mail-in ballots were counted and eventually showed that he had lost.\n\nSince then Trump has resorted to gish galloping, or the practice of overwhelming someone with bad arguments in the hope that it will confuse third parties into not seeing that you're lying and exhaust your opponents by forcing them to debunk all of them. Yet despite repeatedly claiming in public that he was the victim of voter fraud, he never actually alleged voter fraud in more than two-thirds of the 60 cases he brought to court (most likely because deliberately lying to a judge is a crime). More importantly, he lost 59 of the 60 cases he has brought related to the election, winning only in a small procedural case about how much extra time first-time voters in Pennsylvania could get to confirm their identifications in order for their mail-in votes to be counted. Many of the judges who ruled against Trump were Republicans; some were appointed by Trump himself. Trump's own attorney general, William Barr, admitted after investigating that there was no evidence that Biden stole the election. (Trump fired Barr for this, not surprisingly.) The Supreme Court itself ruled unanimously that Trump's fraud claims had no merit, a decision that included the three judges Trump appointed to that bench. Republican legislative leaders in key swing states have resisted Trump's pressure campaign to overturn the election results for the simple reason that it would be illegal for them to do so.\n\nNow Trump is left acting like James Buchanan, the president who was so bitter about Abraham Lincoln winning the 1860 election that he allowed the Civil War to break out rather than work with someone whose political philosophy differed from his own. Yet even Buchanan never contemplated actively stopping Lincoln from serving, or installing himself as a dictator, simply because he did not like the man's views. Trump initially stalled allowed Biden to begin transitioning into the White House, despite the ongoing coronavirus pandemic taking thousands upon thousands of lives, and has allegedly considered imposing martial law so he can stay in power. As of the time of this writing, he continues to insist that he won the 2020 election and is continuing to try to find a way to stay in power.\n\nThis is what makes Trump one of American history's biggest losers. Of the 44 men who have served as president, exactly one-quarter of them were spurned by the voters, but Trump alone within that group has threatened to destroy democracy itself in order to stay in power. Compared to the other ten one termers, Trump comes across as a spoiled brat, a petulant child, a would-be dictator motivated not by principle or necessity but a lifelong habit of crying like a baby if he doesn't get what he wants.\n\nIf he actually was a child, this would merely be pathetic. Because he is threatening democracy itself, however, Trump has sunk below pathetic and crashed through the floor into the realm of being a forever loser. Anyone who supports him in his effort is, by extension, a forever loser too.","source":"alternet","published_at":"2020-12-31T01:12:00-05:00","url":"https://feeds.feedblitz.com/~/640886380/0/alternet/"},{"_id":"alternet--2020-12-31--How the religious lobby is killing porn","title":"How the religious lobby is killing porn","content":"On Tuesday, December 8th, porn-hosting giant Pornhub removed 10 million videos from its platform. The reason for the massive scrub was the result of the company's recognition that sex traffickers had used the site to post videos of rape, sexual assault, and child abuse. On December 14th, released a statement, which said, \"Last week, we enacted the most comprehensive safeguards in user-generated platform history. We banned unverified uploaders from posting new content, eliminated downloads, and partnered with dozens of non-profit organizations…As part of our policy to ban unverified uploaders, we have now also suspended all previously uploaded content that was not created by content partners or members of the Model Program.\"\n\nThey should have said: Under pressure from the porn abolitionist movement that operates under the guise of thwarting sex trafficking, we are going to compromise the economic lives of hundreds of thousands of performers—during a pandemic, no less. I respect and commend those writing and speaking for people who have been trafficked and teenagers whose abusers post revenge porn on Pornhub or other sites. However, who is speaking for the hundreds of thousands of pornographers whose economic livelihoods have been served upon an altar for penance?\n\nCertainly, sex trafficking is a scourge. But censorship is not the answer. As a Pornhub user put it, \"The internet is becoming more and more sanitized every day because of people taking extreme measures to make us 'safer.' It's censorship masquerading as public safety.\"\n\nIn Pornhub's statement, the industry leader noted that the social media giant Facebook reported 84 million cases of flagged items involving sexual abuse on the platform over the past three years. At the same time, the Internet Watchdog Foundation found only 118 such cases on Pornhub. Thus, as Pornhub wrote in their announcement, \"it is clear that Pornhub is being targeted not because of our policies and how we compare to our peers, but because we are an adult content platform.\"\n\nLet me frame this differently: 0.0008 percent of videos on Pornhub featured sexual abuse. As a result, Pornhub elected to purge over 10 million videos and users whose accounts had already been verified. This is a far cry from the site decried as being \"infested with rape videos.\" Yes, as Kristof says, we can agree that \"promoting assaults on children or anyone without consent is unconscionable.\" However, Pornhub nor any other mainstream porn site is invested in such promotion.\n\nNow, in this watershed moment, let us hope nobody falls asleep at the wheel. Sleight of the hand can be hard to catch. The organizations behind the curtain advocating for the purge, such as the National Center on Exploitation and Trafficking Hub, have an end game that is not merely about trafficking or the abuse of children. These are abolitionist groups that see all porn as a public health crisis and that seek to abolish all porn as we know it.\n\nNot only does the porn abolitionists' momentum raise serious concerns regarding free speech and the First Amendment, but puts people's livelihoods at risk. \"Pornhub should have also stood up for sex workers,\" said , a sex worker and founder of .\n\nWhen Pornhub hit the panic button, they did not merely delete the accounts posting illegal content. They removed videos from even their verified users. The only content remaining was from people in their model program. Many online pornographers believe that the end result was that Pornhub became a subscription site only and not public. \"No viewers means no money,\" one Pornhub content producer said regarding the purge.\n\nCompounding pornographers' expected loss of wages, , immediately following the Pornhub purge, that they would no longer process payments from Pornhub, effectively blocking revenue from the site. The move was a reaction to Kristof's Times article about the platform hosting videos depicting child abuse.\n\n\"What bothers me is that Visa and Mastercard are major card companies that have now pulled back from allowing sex workers to make a living because of this one company's giant misstep,\" Akynos told me. \"It won't just be Pornhub that they aren't messing with, it will be everyone else… So, now we have to figure out new ways in order to make money, and this is what sex workers have to do…we are constantly getting trampled on, and then we have to figure out how we can reinvent ourselves and go around and jump through these hoops just so we can make a living.\"\n\nSomething similar happened several years ago following Congress' passage of two related bills whose acronyms stand for \"Victims to Fight Online Sex Trafficking Act\" and \"Stop Enabling Sex Traffickers Act\" respectively. Though ostensibly a bill designed to halt sex trafficking, it had the ancillary effect of squelching the incomes of millions of sex workers by suppressing or censoring the online platforms where they find clients. Indeed, after FOSTA/SESTA's passage, companies such as Payoneer, PayPal, and American Express stopped taking payments from sexual enterprises. In many cases, this meant that sex workers now had to find new sources of income in more dangerous locales in real life.\n\nBeyond Pornhub, the is calling for all credit card companies to stop taking payments from all porn sites. , sex worker and co-founder of the Peepshow Podcast, and I discussed the effects of this crisis on laborers—a subject she unpacks with sex workers on Jessie told me, \"I believe that this will have ripple effects on our industry that extend far beyond Pornhub. Mindgeek [Pornhub's parent company] is the largest company in the industry, and if Visa/Mastercard is willing to pull its financial services from them, the smaller companies are not far behind.\"\n\nFurther, Jessie went on to talk about the financial harms of censorship and the continuing knee-jerk moves from payment processors. \"Right now, 100% of my income comes from the sex industry. About 30% comes from advertising on the podcast (which by the way, our advertisers are all pornographers), and the rest comes from phone sex, video sales, and Onlyfans. So, if clip sites are no longer allowed to process payments, if the bank accounts of performers get shut down, if I can't sell my content to my customers, this will impact both my sex work revenue stream and my multi-media magazine (Peepshow) because it is all funded from the same sources.\"\n\nThis moment is a blip on the screen and part of a much longer history of the coalition between the anti-porn and religious lobbies to rid our society of the so-called \"filth\" that nets billions in profits yearly, providing an honest living for so many.\n\nPornhub's new policy and the ricochet it caused did far more harm to content producers than it did to sex traffickers or pedophiles. The purge caused irrevocable damage to pornographers, and compounds the precarity they and other sex workers have faced under the pandemic. Indeed, Pornhub's new policies will have the most devastating effects on marginalized pornographers. People of color and trans performers, for example, have found spaces for individual entrepreneurship online, in an industry that historically would rarely hire them. We must recognize that Pornhub's censorship and the move to restrict payment processing for all sex workers will have the most devastating effects on the most marginalized.\n\nMany content producers are scared, dismayed, concerned about the online porn industry's future, and livelihoods. I spoke with , a successful online model, who described this situation's stakes in detail. Trip explained:\n\nWe must listen to the voices of adult content producers. Saving, protecting, and supporting sex trafficking and sexual abuse survivors do not have to come at the expense of other marginalized people. This is not a zero-sum game, even if the politically savvy master illusionists in the anti-porn lobby want you to believe it is.","source":"alternet","published_at":"2020-12-31T00:12:00-05:00","url":"https://feeds.feedblitz.com/~/640885398/0/alternet/"},{"_id":"alternet--2020-12-31--Trump’s racism kills 1 in 1,000 Americans","title":"Trump’s racism kills 1 in 1,000 Americans","content":"Covid has now killed 1 in 1000 Americans in less than a year.\n\nHow is it that in Australia it's 3 out of every 100,000 people, and in New Zealand it's 1 out of every 200,000 people, but here in America we're dropping like flies?\n\nChalk it up to Republican racism and a libertarian indifference to the notion of society.\n\nTrump's official emergency declaration came on March 11th, and most of the country shut down or at least went part-way toward that outcome. The Dow collapsed and millions of Americans were laid off, but saving lives was, after all, the number one consideration.\n\nTrump put medical doctors on TV daily, the media was freaking out about refrigerated trucks carrying bodies away from New York hospitals, and doctors and nurses were our new national heroes.\n\nAnd then came April 7th.\n\nI remember that week vividly; it was as if a light switch had been flipped, and I commented on it on my radio show at the time (and many times since).\n\nApril 7th was the day that America learned that the majority of the people who were dying from COVID19 were either elderly, black or Hispanic. Not so many white guys, after all.\n\nExactly one month earlier, on March 7th, Trump had played golf at his club in West Palm Beach, met with Brazilian strongman Jair Bolsonaro at Mar-a-Lago, and visited the CDC headquarters in Atlanta. Over the previous week, US deaths had risen from 4 to 22.\n\nIn March, Jared Kushner even put together an all-volunteer task force of mostly preppie 20-something white men to coordinate getting PPE to hospitals.\n\nThen came April 7th, when the New York Times ran a front-page story with the headline: Black Americans Face Alarming Rates of Coronavirus Infection in Some States. Other media ran similar headlines across the American media landscape, and it was heavily reported on cable news and the network news that night.\n\nAs the New York Times noted that day: \"In Illinois, 43 percent of people who have died from the disease and 28 percent of those who have tested positive are African-Americans, a group that makes up just 15 percent of the state's population. African-Americans, who account for a third of positive tests in Michigan, represent 40 percent of deaths in that state even though they make up 14 percent of the population. In Louisiana, about 70 percent of the people who have died are black, though only a third of that state's population is.\"\n\nAmerican conservatives responded with a collective, \"What the hell?!?\"\n\nLimbaugh declared that afternoon that \"with the coronavirus, I have been waiting for the racial component.\" And here it was. \"The coronavirus now hits African Americans harder – harder than illegal aliens, harder than women. It hits African Americans harder than anybody, disproportionate representation.\"\n\nClaiming that he knew this was coming as if he was some sort of a medical savant, Limbaugh said, \"But now these — here's Fauxcahontas, Cory Booker, Kamala Harris demanding the federal government release daily race and ethnicity data on coronavirus testing, patients, and their health outcomes. So they want a database to prove we are not caring enough about African Americans…\"\n\nIt didn't take a medical savant, of course. African Americans die disproportionately from everything, from heart disease to strokes to cancer to childbirth. It's a symptom of a racially rigged economy and a healthcare system that only responds to money, which America has conspired to keep from African Americans for over 400 years. Of course they're going to die more frequently from coronavirus.\n\nBut the New York Times and the Washington Post simultaneously publishing front-page articles about that disparity with regard to COVID19, both on April 7th, echoed across the rightwing media landscape like a Fourth of July fireworks display.\n\nTucker Carlson, the only primetime Fox News host who'd previously expressed serious concerns about the death toll, changed his tune the same day, as documented by Media Matters for America.\n\nNow, he said, \"we can begin to consider how to improve the lives of the rest, the countless Americans who have been grievously hurt by this, by our response to this. How do we get 17 million of our most vulnerable citizens back to work? That's our task.\"\n\nWhite people were out of work, and black people were most of the casualties, outside of the extremely elderly. And those white people need their jobs back!\n\nBrit Hume joined Tucker's show and, using his gravitas as a \"real news guy,\" intoned, \"The disease turned out not to be quite as dangerous as we thought.\"\n\nLeft unsaid was the issue of to whom it was \"not quite as dangerous,\" but Limbaugh listeners and Fox viewers are anything but unsophisticated when it hearing dog-whistles on behalf of white supremacy.\n\nOnly 12,677 Americans were dead by that day, but now that we knew most of the non-elderly were black, things were suddenly very, very different. Now it was time to quit talking about people dying and start talking about getting people back to work!\n\nIt took less than a week for Trump to get the memo, presumably through Fox and Stephen Miller. On April 12th, he retweeted a call to fire Dr. Anthony Fauci and declared, in another tweet, that he had the sole authority to open the US back up, and that he'd be announcing a specific plan to do just that \"shortly.\"\n\nOn April 13th, the ultra-rightwing, nearly-entirely-white-managed US Chamber of Commerce published a policy paper titled Implementing A National Return to Work Plan.\n\nUnspoken but big on the agenda of corporate America was the desire to get the states to rescind their stay-home-from-work orders so that companies could cut their unemployment tax costs.\n\nWhen people file unemployment claims, those claims are ultimately paid by the companies themselves, so when a company has a lot of claims they get a substantial increase in their unemployment insurance premiums/taxes. If the \"stay home\" orders were repealed, workers could no longer, in most states, file for or keep receiving unemployment compensation.\n\nThe next day, Freedomworks, the billionaire-founded and -funded group that animated the Tea Party against Obamacare a decade earlier, published an op-ed on their website calling for an \"economic recovery\" program including an end to the capital gains tax and a new law to \"shield\" businesses from lawsuits.\n\nThree days after that, Freedomworks and the House Freedom Caucus issued a joint statement declaring that \"[I]t's time to re-open the economy.\"\n\nFreedomworks published their \"#ReopenAmerica Rally Planning Guide\" encouraging conservatives to show up \"in person\" at their state capitols and governor's mansions, and, for signage, to \"Keep it short: 'I'm essential,' 'Let me work,' 'Let Me Feed My Family'\" and to \"Keep [the signs looking] homemade.\"\n\nOne of the first #OpenTheCountry rallies to get widespread national attention was April 19th in New Hampshire. Over the next several weeks, rallies had metastasized across the nation, from Oregon to Arizona, Delaware, North Carolina, Virginia, Illinois and elsewhere.\n\nOne that drew particularly high levels of media attention, complete with swastikas, confederate flags and assault rifles was directed against the governor of Michigan, rising Democratic star Gretchen Whitmer.\n\nWhen Rachel Maddow reported on meatpacking plants that were epicenters of mass infection, the conservative Chief Justice of the Wisconsin Supreme Court pointed out that the virus flare wasn't coming from the \"regular folks\" of the surrounding community; they were mostly Hispanic and Black.\n\nThe conservative meme was now well established.\n\nAbout a third of the people the virus killed were old folks in nursing homes. Which, commentators on the right said, could be a good thing for the economy because they're just \"useless eaters\" who spend our Medicaid and Social Security money but are on death's door anyway.\n\nFor example, Texas's Republican Lt. Governor Dan Patrick told Fox News, \"Let's get back to living... And those of us that are 70-plus, we'll take care of ourselves.\"\n\nA conservative town commissioner in Antioch, CA noted that losing many elderly \"would reduce burdens in our defunct Social Security System…and free up housing…\" He added, \"We would lose a large portion of the people with immune and other health complications. I know it would be loved ones as well. But that would once again reduce our impact on medical, jobs and housing.\"\n\nThen came news that the biggest outbreaks were happening in prisons along with the meatpacking plants, places with few white people (and the few whites in them were largely poor and thus disposable). Trump's response to this was to issue an executive order using the Defense Production Act (which he had refused to use to order production of testing or PPE equipment) to order the largely Hispanic and Black workforce back into the slaughterhouses and meat processing plants.\n\nAfrican Americans were dying in our cities, Hispanics were dying in meatpacking plants, the elderly were dying in nursing homes.\n\nBut the death toll among white people, particularly affluent white people in corporate management who were less likely to be obese, have hypertension or struggle with diabetes, and more likely to work from home was relatively low. And those who came through the infection were presumed to be immune to subsequent bouts, so we could issue them \"COVID Passports\" and give them hiring priority.\n\nAs an \"expert\" member of Jared Kushner's team of young, unqualified volunteers supervising the administration's PPE response to the virus noted to Vanity Fair's Katherine Eban, \"The political folks believed that because it was going to be relegated to Democratic states, that they could blame those governors, and that would be an effective political strategy.\"\n\nIt was, after all, exclusively Blue states that were then hit hard by the virus: Washington, New York, New Jersey and Connecticut.\n\nRobert F. Kennedy's grandson Max Kennedy Jr, 26, was one of the volunteers and blew the whistle to Congress on Kushner and Trump. As Jane Mayer wrote for The New Yorker, \"Kennedy was disgusted to see that the political appointees who supervised him were hailing Trump as 'a marketing genius,' because, Kennedy said they'd told him, 'he personally came up with the strategy of blaming the states.'\"\n\nSo the answer to the question of why, at year's end, the United States has about 20% of the world's Covid deaths, but only 4.5% of the world's population, is pretty straightforward: Republicans were just fine with Black people dying back in April, particularly since they could blame it on Democratic Blue-state governors.\n\nAnd once they put that strategy into place in April, it became politically impossible to back away from it, even as more and more red-state white people became infected.\n\nEverything since then – right down to Trump's December 26th tweet (\"The lockdowns in Democrat-run states are absolutely ruining the lives of so many people - Far more than the damage that would be caused by the China Virus.\") – has been a double-down on death and destruction, now regardless of race.\n\nThom Hartmann is America's number one progressive talk-show host and the New York Times bestselling author of The Hidden History of American Oligarchy and more than 30 other books in print. His online writings are compiled at HartmannReport.com. He is a writing fellow at the Independent Media Institute.\n\nThis article was produced by Economy for All, a project of the Independent Media Institute.","source":"alternet","published_at":"2020-12-31T00:12:00-05:00","url":"https://feeds.feedblitz.com/~/640884954/0/alternet/"},{"_id":"americanintelligencemedia--2020-12-31--Who are you, Mike Pence? Did you Rape and Murder Children in Indiana?","title":"Who are you, Mike Pence? Did you Rape and Murder Children in Indiana?","content":"Mike Pence is counting the electoral college votes. Who is Mike Pence? What is his political agenda? Is he compromised? Could he be blackmailed?\n\nInquiring minds want to know.\n\nWho are you, Mike Pence?\n\nThe Power of the One Who Counts Votes\n\nYou mean this Mike Pence is the ONE counting the votes? This video about Mike Pence is from May 29, 2016. There is no proof offered in the video, only Tory Smith’s testimony which may or may not be true. Tory has since been murdered. Please do not take this video as fact – but something to research yourself. These are the kinds of videos we watched in the internet during the 2016 election about Mike Pence.\n\nAlso see INDIANA Special Party Mike Pence Murdered his 36th Child\n\nWe are sending you to the YT channel directly so that you can copy the video and save for your records.\n\nWonder what was in Mike’s envelope?\n\nOur reminder to all of you like Leah Dundas that would believe the words of a politician, even of Mike Pence’s whose promises she quoted at the end of her video.\n\nWe smell something something rotten with Mike Pence.\n\nMike Pence gives approval for illegal biological weapons P-4 laboratory In Indiana. Is working with Rothschilds and Pilgrims to exterminate humanity with bioweapons called ‘vaccines’","source":"americanintelligencemedia","published_at":"2020-12-31T01:12:00-05:00","url":"https://aim4truth.org/2020/12/30/who-is-mike-pence/"},{"_id":"bbc--2020-12-31--Brexit: New EU trade arrangements to begin after Parliament vote","title":"Brexit: New EU trade arrangements to begin after Parliament vote","content":"The House of Lords later passed it at third reading - its final stage - without a vote and the Queen - who is spending the festive period at Windsor Castle rather than Sandringham because of the coronavirus pandemic - gave the final approval, Royal Assent.","source":"bbc","published_at":"2020-12-31T00:12:00-05:00","url":"https://www.bbc.co.uk/news/uk-politics-55493437"}]}