{"count":37,"next":"http://zerocool.mgruppi.me:8000/newsArticles/?content__contains=school&format=json&page=2&published_at=&published_at__gt=&published_at__lt=&source=&title=&title__contains=+RPI+","previous":null,"results":[{"_id":"newyorker--2020-04-14--National Archives Report Someone Tried to Scrawl “Total Authority” with Sharpie on U.S. Constitution","title":"National Archives Report Someone Tried to Scrawl “Total Authority” with Sharpie on U.S. Constitution","content":"WASHINGTON (The Borowitz Report)—An unknown person attempted to scrawl the words “TOTAL AUTHORITY” on the United States Constitution with a Sharpie, the National Archives reported on Tuesday.\n\nA security guard spotted the attempted vandalism on Tuesday morning, when he noticed “something weird” on the glass case protecting the priceless historical document.\n\n“Someone had written the words in big block letters,” the security guard said. “Plus, both ‘total’ and ‘authority’ were misspelled.”\n\n“It looked like the work of a small child, but there are no school groups here because of the coronavirus and whatnot,” he added. “So it’s a real mystery.”\n\nHarland Dorrinson, a spokesperson for the National Archives, said that, even though the Constitution was unharmed, the Archives are launching a “full investigation” to determine what “sick person” attempted to deface the document.\n\n“Somewhere in Washington, there’s a person on the loose who hates the way the Constitution is actually written,” he said.","source":"newyorker","published_at":"2020-04-14T15:04:00-04:00","url":"https://www.newyorker.com/humor/borowitz-report/national-archives-report-someone-tried-to-scrawl-total-authority-with-sharpie-on-us-constitution"},{"_id":"theborowitzreport--2020-04-14--National Archives Report Someone Tried to Scrawl “Total Authority” with Sharpie on U.S. Constitution","title":"National Archives Report Someone Tried to Scrawl “Total Authority” with Sharpie on U.S. Constitution","content":"WASHINGTON (The Borowitz Report)—An unknown person attempted to scrawl the words “TOTAL AUTHORITY” on the United States Constitution with a Sharpie, the National Archives reported on Tuesday.\n\nA security guard spotted the attempted vandalism on Tuesday morning, when he noticed “something weird” on the glass case protecting the priceless historical document.\n\n“Someone had written the words in big block letters,” the security guard said. “Plus, both ‘total’ and ‘authority’ were misspelled.”\n\n“It looked like the work of a small child, but there are no school groups here because of the coronavirus and whatnot,” he added. “So it’s a real mystery.”\n\nHarland Dorrinson, a spokesperson for the National Archives, said that, even though the Constitution was unharmed, the Archives are launching a “full investigation” to determine what “sick person” attempted to deface the document.\n\n“Somewhere in Washington, there’s a person on the loose who hates the way the Constitution is actually written,” he said.","source":"theborowitzreport","published_at":"2020-04-14T15:04:00-04:00","url":"https://www.newyorker.com/humor/borowitz-report/national-archives-report-someone-tried-to-scrawl-total-authority-with-sharpie-on-us-constitution"},{"_id":"theguardianuk--2020-04-15--René Higuita’s scorpion kick is a thing of beauty – so let's debunk it | Max Rushden","title":"René Higuita’s scorpion kick is a thing of beauty – so let's debunk it | Max Rushden","content":"The existential crisis for football writers is real as we approach week four without our subject matter. All of us – even the most experienced Sunday Supplementers (your Winters, your Samuels, your Liews), have done “I miss football” and “Does it matter anyway?” We do and it kind of does. So what now?\n\nLike a manager desperate for a result at any cost – perhaps you revert back to old tactics, your Wilsons analysing the influence of 1920s Hungarian tactics on Dave Bassett, your Delaneys and all your Harrises giving their mentions another hammering by questioning Middle East states buying Premier League clubs.\n\nMy fallback, as Barry Glendenning politely puts it on the Guardian Football Weekly podcast, is “What I did on my summer holidays” journalism, perhaps something about my dad and my childhood and amateur football. It resonates – other people have dads, play football and were, at one point, children.\n\nMaybe it’s time to accept the inevitable and trot out some transfer rumours. How many of us will sleep better tonight if we speculate where Jack Grealish, Declan Rice and Donny van de Beek might be in six months? As long as it’s outside – and permitted – that will surely do.\n\nIt’s too early for “What isolation has taught me”, given many of them are already in people’s drafts, and sports journalists should make a collective solemn vow never to publish them. Really, you just need a column to go in off your backside and then they’ll start to flow.\n\nOne alternative, for all of us, is to completely reinvent ourselves. After all, no one can see you and the only thing we’re really concentrating on is trying to avoid people walking directly towards us. If it doesn’t work, no one will remember and you can blame it on the lockdown.\n\nSo here goes. For too long now (not that anyone would notice) I have been avoiding confrontation, trying to keep gainful employment by just offering inoffensive platitudes and harmless nostalgia. Well not any more. I’m here for clicks and retweets. Here to cause controversy for the sake of it. The 5G conspiracy theorist of football. Here to expose what the mainstream media – excluding Eamonn Holmes, of course – have tried to hide from you for years. In footballing terms that means taking something good and exposing it as somehow fraudulent.\n\nIt’s 6 September 1995. A meaningless England friendly against Colombia at Wembley. We all know the moment. René Higuita’s scorpion kick to clear Jamie Redknapp’s overhit cross. A moment so extraordinary it ranked 94th in Channel 4’s 100 Greatest Sporting Moments in 2002, above Arthur Ashe winning Wimbledon and one place below Zola Budd’s and Mary Decker’s collision in 1984.\n\nBut Higuita’s scorpion kick was a fraud. I know. I was there. Not many of us were. As Richard Williams wrote in this paper: “If there were in reality even half the officially reported number of 20,000 spectators in the stadium it would be a surprise.”\n\nIt was my second England game, and my second goalless draw after watching a stalemate with Norway the previous year when Dennis Wise filled the troublesome left side and Steve Bould played his last game for his country. Anyone who was at that game would be forgiven for being put off international football for life.\n\nThere were first starts for Nicky Barmby and Steve McManaman, while Redknapp got his debut. It turned out to be John Barnes’s final outing in an England shirt. That should be the story of this game when we look back. A man who scored that goal at the Maracanã, who gave us hope where there had been none against Argentina in ’86, who had to put up with vile abuse for much of his international career.\n\nBut it is Higuita’s game. In the Guardian in 2007, the brilliant Marcela Mora Y Araujo said: “His scorpion kick in a friendly against England at Wembley is of undeniable wow status, and… served to position him in fandom psyche as one of the most entertaining players ever to grace the pitches.”\n\nDavid Ospina talked about it on the eve of the 2018 Carabao Cup final: “We were delighted … we talked about it a lot. It was great he did it at Wembley, too. For us Colombians, Higuita is a really important figure, it’s nice that he is remembered here for something special.”\n\nAfter the game, Higuita said: “It’s the sort of thing only one person can do. I have a massive repertoire but I don’t plan them ahead.” I beg to differ, René.\n\n“Goodness me!” exclaimed Ian Darke in commentary. “Have you ever seen anything like it in your life from a goalkeeper?” Well yes I had. For the entire warm-up. Over and over and over again. Scorpion kick after scorpion kick after scorpion kick. When it happened in the game, I remember thinking: “I’ve seen that before, about 25 minutes ago.” And it was offside and the ball from Redknapp was so perfect you wonder if he was in on it – there’s your 5G mast right there.\n\nYou may ask whether this really matters? Why can’t we just have fond memories, even if it means we can’t handle the truth? It’s also quite obvious now that in attempting to move away from my “What I did on my summer holidays” Fisher Price school of journalism, I have drawn upon a story quite literally from my summer holidays.\n\nAnd while we’re here, I should point out that even if Higuita did see the linesman’s flag, and even if he did practise the move, so what: it’s still some feat to pull that off and make clean contact. So I take it all back. What a glorious “I was there” moment.\n\nSo (leans back in chair) perhaps that is what isolation has taught me. There will be no reinvention in lockdown. Not for me, not for you, not for René Higuita. Those of us lucky enough to emerge from this will come out pretty much the same as we went in. If that means living off a split-second acrobatic jump, then you are probably winning.","source":"theguardianuk","published_at":"2020-04-15T18:04:00-04:00","url":"https://www.theguardian.com/football/blog/2020/apr/15/rene-higuita-scorpion-kick-football-isolation"},{"_id":"theguardianuk--2020-02-09--Parasite review – a gasp-inducing masterpiece","title":"Parasite review – a gasp-inducing masterpiece","content":"The ideal way to experience South Korean auteur Bong Joon-ho’s awards-garlanded, international box-office smash is with as little prior knowledge as possible. So if you’re reading this before seeing the film, and you’ve managed to avoid the whirlwind of publicity it has attracted since winning the Palme d’Or last May, it may be simpler to just stop and head straight to the cinema. Because, at the risk of adding to the hype, Parasite really is the kind of remarkable experience that makes modern movie-going such a joy. I saw it for the fourth time last week and I’m now desperate to view the black-and-white version that Bong recently unveiled at the Rotterdam film festival.\n\nDescribed by its creator as “a comedy without clowns, a tragedy without villains”, Parasite is more Shakespearean than Hitchockian – a tale of two families from opposite ends of the socioeconomic spectrum, told with the trademark genre-fluidity that has seen Bong’s back catalogue slip seamlessly from murder mystery, via monster movie, to dystopian future-fantasy and beyond. We first meet the Kim family, headed by father Ki-taek (Song Kang-ho) and mother Chung-sook (Chang Hyae-jin), in their lowly semi-basement home, hunting for stray wifi coverage and leaving their windows open to benefit from bug-killing street fumigation. They have nothing but one another and a shared sense of hard-scrabble entrepreneurism. So when son Ki-woo (Choi Woo-shik) is faced with an unexpected opportunity to home-tutor a rich schoolgirl, he gets his gifted artist sister, Ki-jung (Park So-dam), to forge a college certificate, bluffing his way into the job and into the home of the Park family.\n\nAn architectural wonder perched high above the slums of Seoul, with views not of urinating drunks but of luxurious lawns and starlit skies, this wealthy house is everything the Kims’ pokey dwelling is not: elegant, angular and weirdly isolated. While aloof businessman Mr Park (Lee Sun-kyun) is at work, his anxious, uptight wife, Yeon-kyo (Cho Yeo-jeong), tends to their coquettish daughter and hyperactive young son. It’s a lifestyle that relies upon hired help: tutors, a chauffeur and, most importantly, a devoted housekeeper Moon-gwang (Lee Jung-eun), who stayed with the building after its original architect owner moved out. Spying an opening, Ki-woo (newly dubbed “Kevin”) realises that his own family could easily fill such roles, and hatches a plan that will inveigle the Kims into the privileged lives and home of the Parks.\n\nBeyond the deliberate ambiguity of the title (which, like Jordan Peele’s oddly comparable Us, cuts both ways), Bong once again foregrounds a distrust of wealth and authority that has been a recurrent feature of his work since his 2003 breakout Memories of Murder, continuing through films as diverse as The Host, Mother, Okja and, of course, Snowpiercer, to which Parasite contains several knowing nods.\n\nThe Kim family may live in sewage-flooded squalor, but they are clearly every bit as smart as, and a lot more united than, the Parks, who turn their noses up at the smell of “people who ride the subway”. Similarly, while the smug Mr Park is habitually depicted ascending the stairs of his ultra-modern home, and the Kims are pictured scampering down city steps to their own underworld apartment, it’s clear who holds the dramatic high ground.\n\nWhen it comes to deception, too, those on the upper rungs of the societal ladder are as practised as those upon whom they look down. In a world of vertical non-integration, Parasite finds gasp-inducing depths lurking beneath even the most apparently placid surfaces. Yet Bong is careful to keep his opposing forces keenly balanced, creating the cinematic equivalent of a Rorschach inkblot test in which the audience is invited to decide for themselves the precise meaning of these strangely symmetrical apparitions.\n\nPerfectly accompanying the film’s tonal shifts is Jung Jae-il’s magnificently modulated music, which moves from the sombre piano patterns of the curtain-raiser, through the mini symphony of The Belt of Faith to the cracked craziness of cues in which choric vocals do battle with a musical saw. Just as the action can segue from slapstick to horror and back – sometimes within the space of a single scene – so Jung plays things straight even as madness beckons, ensuring that the underlying elements of pathos are amplified rather than undercut by pastiche.\n\nFor me, Parasite is best described as a melancholy ghost story, albeit one disguised beneath umpteen layers of superbly designed (and impeccably photographed) generic mutations. Thrillingly played by a flawless ensemble cast who hit every note and harmonic resonance of Bong and co-writer Han Jin-won’s multitonal script, it’s a tragicomic masterclass that will get under your skin and eat away at your cinematic soul.","source":"theguardianuk","published_at":"2020-02-09T08:02:00-05:00","url":"https://www.theguardian.com/film/2020/feb/09/parasite-review-bong-joon-ho-tragicomic-masterpiece"},{"_id":"lifesitenews--2020-02-19--Catholic university opens up &#8216;LGBT rights&#8217; center, touts &#8216;Jesuit underpinnings&#82","title":"Catholic university opens up &#8216;LGBT rights&#8217; center, touts &#8216;Jesuit underpinnings&#8217;","content":"February 18, 2020 (Joseph Sciambra) — On February 14, 2020, Gonzaga University opened its new Lincoln LGBTQ+ Rights Clinic on its Spokane, WA, campus. According Jacob Rooksby, dean at Gonzaga’s School of Law: “Gonzaga Law School is one of only a handful of institutions of higher education across the nation to launch this kind of initiative.”\n\nFrom a press release announcing the opening of the LGBTQ+ Rights Clinic:\n\nGonzaga will join law schools at universities such as Harvard, Cornell, Emory, and UCLA in the development of an LGBTQ+ clinic, all of which are focused on outreach and promoting reforms that support those who are marginalized and underserved because of their gender identity or expression.\n\nJason Gillmer, professor and director of Gonzaga’s Center for Civil and Human Rights, said:\n\n“The Lincoln LGBTQ+ Rights Clinic provides a special opportunity for Gonzaga law students to help protect and advance the rights of the LGBTQ+ community, both regionally and nationally.” He continued: “Through the Center, the clinic will also provide students and faculty with opportunities to engage in broader policy discussions about LGBTQ+ rights as we continue to strive for equality.”\n\nThe Clinic received a “significant donation” from Gonzaga alumnus Joe Lincoln — who also serves as a Regent of the University; Lincoln also donated $100,000 towards Gonzaga’s LGBT Center called the Lincoln LGBT Center — the first such center at a Jesuit university. In 2016, the Center hosted a drag show, attended by professor of philosophy Fr. Timothy Clancy, in honor of “pride” week.\n\nAccording to the Center’s web-page:\n\nWe want Gonzaga’s queer people and queer persons of color to know that your LGBTQ+ resource center is a place you can relax with people who will not only accept you, but also do what we can to help you develop holistically throughout your time at Gonzaga, in the spirit of our university’s Jesuit underpinnings.\n\nSeveral other Jesuit universities in the U.S. have a history of LGBT advocacy; they include: The University of San Francisco, Fordham, Seattle University, Creighton University, and Georgetown.","source":"lifesitenews","published_at":"2020-02-19T01:02:00-05:00","url":"https://www.lifesitenews.com/news/catholic-university-opens-up-lgbt-rights-center-touts-jesuit-underpinnings"},{"_id":"chicagosun-times--2020-04-19--Fiona Apple’s new album: Every listen uncovers new wisdom in the densely emotional masterpiece","title":"Fiona Apple’s new album: Every listen uncovers new wisdom in the densely emotional masterpiece","content":"There’s something enormously comforting about a new Fiona Apple album.\n\nEvery seven or eight years, the reclusive, media-shy singer reemerges with a new body of work more idiosyncratic and adventurous than the last as she hums and howls and huffs over a maelstrom of instruments fighting for attention. Apple’s music is controlled chaos anchored by her familiar staccato, which pretzels from a gentle whisper to an exasperated drawl in a matter of seconds.\n\nHer vocal acrobatics are vividly on display from the aching opening minutes of “Fetch the Bolt Cutters,” out last week, Apple’s fifth album and her first since 2012’s “The Idler Wheel...” As she sings gravelly over a warm piano on the first track, “I Want You to Love Me,” Apple’s words trip over each other and spill out like word soup as she struggles to articulate her feelings.\n\nAnd I know none of this will matter in the long run\n\nBut I know a sound is still a sound around no one.\n\nAnd while I’m in this body\n\nI want somebody to want\n\nAnd I want what I want and I want you.\n\nThe song culminates in what can only be described as Apple making dolphin noises for 15 amusingly jarring seconds. It’s not the last time she taps into her animal instincts: The percussive title track ends with a cacophony of dog barks and heavy panting as actress-turned-backup vocalist Cara Delevingne softly “meows.” There’s no discernible reason or logic behind these sonic diversions, but there doesn’t need to be. Apple is simply having fun.\n\n”Fetch the Bolt Cutters” simmers with defiance, dark wit and quiet rage, most notably on the title track. Here, Apple discerningly looks back on her younger self: a naive, less-confident woman still finding her voice and living in the shadow of a powerful, temperamental man. (The song seems vaguely inspired by Apple’s ex-boyfriend of three years, “There Will Be Blood” director Paul Thomas Anderson, whom she started dating in 1997 and described in a New Yorker profile as “coldly critical” of her.)\n\nAll the VIPs, PYTs and wannabes, afraid of not being your friend.\n\nAnd I’ve always been too smart for that, but you know what?\n\nMy heart was not. I took it like a kid, you see. ...\n\nI’m ashamed of what it did to me – what I let get done.\n\nApple, 42, has been bracingly confessional ever since her 1996 debut, “Tidal.” In rare interviews, she’s spoken openly about when she was raped by a stranger at 12 years old outside her mom’s Manhattan apartment. On this album’s haunting, heartbreaking standout “Newspaper,” she speaks directly to a fellow victim of sexual assault, sharing her complicated feelings about an unspecified abuser and how she’s “trying not to let my light go out.”\n\nIt’s a shame that you and I didn’t get a witness\n\nWe’re the only ones who know.\n\nWe were cursed the moment that he kissed us\n\nFrom then on, it was his big show.\n\nShe broaches the subject again on “For Her,” which Apple says was inspired by the anger she felt when Brett Kavanaugh was sworn in to the Supreme Court in 2018 after professor Christine Blasey Ford testified that he sexually assaulted her in high school. The cathartic, disarmingly cheery track interpolates “Good Morning,” made famous by 1952 movie musical “Singin’ in the Rain.”\n\n”Well, good morning! Good morning!” Apple wails against a backdrop of ominous drums and gospel harmonies. “You raped me in the same bed your daughter was born in.”\n\nThese are the kinds of razor-sharp statements and evocative lyrics that reveal themselves in every new listen of “Fetch the Bolt Cutters,” a dense and richly poetic masterpiece from one of music’s best modern storytellers.","source":"chicagosun-times","published_at":"2020-04-19T19:04:00-04:00","url":"https://chicago.suntimes.com/2020/4/19/21227365/fiona-apple-review-album-fetch-bolt-cutters"},{"_id":"usnews--2020-04-23--Burping Bags and Dancing Raisins: Tricks for Teaching Science During a Pandemic","title":"Burping Bags and Dancing Raisins: Tricks for Teaching Science During a Pandemic","content":"(Reuters) - Texas science teacher Avri DiPietro has a secret weapon in her tool kit to help keep her students engaged now that the coronavirus pandemic has forced them to stay home indefinitely. It's a home experiment known as \"the burping bag.\"\n\nThe assignment calls for her sixth graders to combine vinegar and baking soda in a plastic bag, either in their kitchens or backyards. If all goes as planned, burps and belches will ring out across the small southeastern Texas town where DiPietro teaches, as the acidic vinegar meets the sodium bicarbonate, releasing gas from the bag.\n\n\"My thing has been to get science into their homes and get them doing science... it's about discovery,\" said DiPietro, who teaches about 160 students between the ages of 11 and 14 in Lockhart, about 30 miles (48 km) south of Austin. \"This is pushing a lot of us educators in how to reach our kids.\"\n\nTeachers across the United States have had to scramble to develop online lesson plans in a matter of days after nearly every state closed schools and businesses to stop the deadly virus from spreading. Since then, it has been a struggle to keep many children from becoming distracted and tuning out during the school day, many educators say.\n\nFor science teachers like DiPietro, the challenge is especially formidable. One solution has been to assign hands-on experiments that students can conduct at home, keeping them engaged even though the school laboratory is closed.\n\nTeachers will typically post lists of the ingredients needed for the experiment, detailed instructions, and possible observations and outcomes in their virtual classrooms. Then students spring into action, raiding their home's pantries and cabinets for materials before turning their back porches and kitchens into makeshift science labs.\n\n\"It really makes parents understand what teachers go through on a day-to-day basis... they have to find innovative ways to keep our kids busy,\" Heather Simpson said after her son Houstin one of in DiPietro's students, conducted a \"homemade lava lamp\" experiment with water, food coloring, salt, oil, and a jar.\n\nSeveral second graders at Park Elementary School in Fairmount, a rural community in northeast Indiana, also got in on the act. The 7 to 8-year-olds completed a \"walking water\" experiment with strips of paper towels, food coloring, water, and cups.\n\n\"It entertains me to watch their videos and seeing their pictures,\" said Rebecca Freel, his teacher at Park Elementary who assigned the experiment. \"They are learning more from doing this than if I just gave them a paper to do or a website to go on. They really have to dive in and think.\"\n\nSome also may not be able to get the necessary ingredients and materials for the experiments. As a result, most of the experiments are simple, involving just a few household ingredients and steps. Many are optional or for extra credit.\n\nThere is always the potential for failed experiments, too. But the duds are valuable teaching moments, said Libby Birmingham, who teaches science at Stanton Elementary in Glendora, California, 30 miles east of Los Angeles.\n\n\"I'm trying to get them to be inquisitive and asking questions,\" said Birmingham, who chuckled after dumping salt all over her laptop's keyboard during one experiment as her students watched live online.\n\nBirmingham has held virtual classroom sessions from her front porch since her school closed on March 13. She has also conducted a \"cloud in a jar\" experiment with shaving cream, water and food coloring that shows precipitation and evaporation.\n\nIn another experiment, known as \"dancing raisins,\" Birmingham demonstrated for her students the effect that carbon dioxide gas has on the fruit's volume when it is submerged in a carbonated liquid.","source":"usnews","published_at":"2020-04-23T11:04:00-04:00","url":"https://www.usnews.com/news/us/articles/2020-04-23/burping-bags-and-dancing-raisins-tricks-for-teaching-science-during-a-pandemic"},{"_id":"bbcuk--2020-05-22--Lockdown Lego: The enthusiasts building mini masterpieces","title":"Lockdown Lego: The enthusiasts building mini masterpieces","content":"Thousands of Lego-builders have been taking advantage of lockdown and making use of their spare time to create stop-motion movies and models of real-life constructions.\n\nThe Danish toy has been the subject of more internet searches during lockdown than in the same months in previous years, while in March the search term \"Lego challenge\" reached a \"record high\", according to Google Trends.\n\nSo, why have so many people turned to the little plastic bricks for entertainment and what comfort has it brought while holed up at home?\n\n'The fireball was a 'don't try this at home' moment'\n\n\"I never expected it to get this much exposure - I've had more credit for this than for my actual work,\" said composer Jon Opstad.\n\nWith the help of his six-year-old son Ollie and four-year-old daughter Alice, he has been recreating famous James Bond scenes from the likes of Thunderball and The Living Daylights.\n\nTheir stop-motion animation of \"the jet-pack scene\" from Thunderball has been shared almost 400,000 times on social media, including by Lego, the official James Bond account, and celebrities such as David Walliams and James Corden.\n\n\"Everything was done on camera, no special effects were added later,\" said the 36-year-old 007 fan.\n\n\"We found soda crystals made very realistic snow and we even managed to make the Aston Martin car look as though it was being blown up using a small fireball.\n\n\"That was a 'don't try this at home moment'.\"\n\nMr Opstad, from Haringey, north London, said they worked on creating the scenes for three hours a day for a week.\n\n\"The kids were very much involved in building the chateau for Thunderball and other sets, as well as painting backdrops, though when it got to the boring stage of taking lots of photos, I took over.\"\n\nMr Opstad described making the movies as \"really positive time spent with the children\".\n\n\"Lego is great for problem-solving and creativity so it has been a great way to get the kids involved in something that isn't screen-time.\"\n\nHe said he was keen to create a scene from another four Bond films, in order to include all six 007 actors, but added \"it might be a little over-ambitious\".\n\n\"It's an iconic local building and, given the current situation, the NHS was at the forefront of my mind,\" said Ricky Parkes, who helped his daughter Elsie recreate King's Mill Hospital in Sutton-in-Ashfield, Nottinghamshire.\n\nHe said the eight-year-old was given a task by school of making a model of a local building from any material.\n\n\"We used at least 1,200 bricks from a lot of sets that we have collected over the years, even some from my childhood,\" said Mr Parkes.\n\n\"We actually ran out of white bricks so the back of the hospital is made up of various multi-coloured bricks.\"\n\nHe said the pair had previously done other \"big builds\" together, like the Harry Potter Hogwarts Castle, and described the time spent together as \"amazing\".\n\n\"As my wife and I have been furloughed from work, we have both been home-schooling the children. As much as we try to make it fun, it can be a little stressful at times, so this project was a much welcome bit of respite for us all.\"\n\n'We ended up on telly in Australia'\n\nJonathan Oakes and his music festival-loving housemate Adam Hardman started off by making a model of Glastonbury's Pyramid Stage before moving on to recreating Creamfields and the 1985 Live Aid event, complete with lights, smoke and music.\n\nTheir homage to the Worthy Farm extravaganza has had about six million views across social media and the pair have had people offer money for their models, with requests from Japan and New York.\n\nThey have even appeared on a chat show in Australia.\n\n\"When people who were missing not being able to go to festivals this year saw it, it just blew up,\" said Jonathan, from Warrington.\n\n\"It started off as just two blokes messing about and killing some time in the garden and the next thing we know we're on telly in Australia - crazy.\"\n\nThe project took on a life of its own and grew bigger as the pair kept adding to their models.\n\n\"We had a load of old Lego in the loft that we've both had since we were kids. Once the stage was done we wanted to make it look like the figures were singing on stage,\" said Jonathon.\n\n\"Then we made it look like there was a bit of a crowd and we just kept adding to it and adding to it. We started at lunchtime and by 11 o'clock at night we were still out there. After sundown the atmosphere was just incredible.\n\n\"Adam has done DJing, so that's where the lights and smoke machine came in.\"\n\nYou might also be interested in:\n\nThe rise of the lockdown milkmen and women\n\nEven though people are willing to buy their creations, the pair are now using their builds to raise money for charity.\n\nThe Adam Lewis Effect Foundation was up set up after their friend, Adam Lewis, died from Sudden Arrhythmic Death Syndrome in 2014.\n\nThe charity, of which the housemates are both patrons, raises funds to provide cardiac screening for young people.\n\n\"We have instead asked people to donate money in memory of Adam,\" said Jonathan.\n\n'I couldn't go to the pub... so I made one'\n\n\"Building Lego has always been very much a happy thing for me to do - it's probably no surprise I went on to be architect,\" said Tim Hatton.\n\n\"I created my local pub, the Phoenix Inn, out of lots of bits and pieces from different sets, as a way of getting a bit of 'me time'.\n\n\"I thought it would be fun to build a pub, given I couldn't go to one, and then ask people to guess which one.\"\n\nIt took the 39-year-old from York about four hours to create his mini masterpiece, which he later posted a picture of on social media.\n\n\"I did Google a few photos of it but to be honest I've spent quite a bit of time in there so most of it was done from memory.\n\n\"It has quite a lot of interesting features - a lovely fire, quite a compact bar area and three openings on to the bar, including one from an usual little corridor. It's full of character.\"\n\nMr Hatton said it had been \"a great way to take my mind away from everything\".\n\n\"People's mental health is one of the biggest concerns that's coming out of this in the long-run. I will definitely create more.\"\n\nMel Abbott and her son Buddy have been sorting through and reconstructing disused sets - turning them back into monster trucks, caravans and cars one layer at a time.\n\nBut first of all they had to categorise hundreds of individual bricks because their 30 sets had been mixed up over the years.\n\n\"Its been nice to spend time working together, and it's also quite satisfying,\" said Ms Abbott, from Wareham in Dorset.\n\n\"They had been built and taken apart over about four years, so there were a lot of single bricks. Luckily I'd kept all the instruction books.\"\n\nShe and Buddy, eight, have gone one step further and put the bricks into colour-coded boxes so they are easier to find in future.\n\n\"If we've not been able to find the right pieces we have had to adapt and use a different colour brick,\" she said. \"We are now into the third week - doing about one to two hours work a day, rebuilding up to two models each day.\n\n\"It's quite therapeutic putting them back together but we are definitely not going to buy any more.\"\n• A SIMPLE GUIDE: How do I protect myself?\n• AVOIDING CONTACT: The rules on self-isolation and exercise\n• MAPS AND CHARTS: Visual guide to the outbreak\n• STRESS: How to look after your mental health","source":"bbcuk","published_at":"2020-05-22T23:05:00-04:00","url":"https://www.bbc.co.uk/news/uk-england-52559798"},{"_id":"theindependent--2020-05-26--Beautiful Thing: Why you should watch Normal People director Hettie Macdonald&apos;s forgotten queer","title":"Beautiful Thing: Why you should watch Normal People director Hettie Macdonald&apos;s forgotten queer masterpiece","content":"In a summer where we have to stay inside, watching Normal People’s Connell (Paul Mescal) and Marianne (Daisy Edgar-Jones) eating fig salads next to swimming pools in rural Italy is beautiful torture. Over 16.2 million people tuned in to watch the BBC adaptation of Sally Rooney’s Booker prize-nominated novel in its first week; 139,000 now follow an Instagram account dedicated solely to Connell’s “Argos chic” chain. With its frank depictions of the mouth-chewing anxieties of first love, high-school bullies and university seminar snobs, Normal People has surpassed The Wire to become everyone’s favourite thing to shout at you for not watching.\n\nMuch was made of Room director Lenny Abrahamson’s work on the series – but he only directed half of the episodes. Hettie Macdonald was responsible for the rest, and is just as much a part of piecing together those gut-punching, painful sex scenes that made us all send regrettable “miss you” texts to our exes. Normal People’s popularity has brought a newfound attention to Macdonald, who’s known for making the most popular Doctor Who episode of all time (“Blink”), but has done so much more than that. Through a mix of tender but rough-edged realism, Macdonald makes social dramas that make you care about characters as if they were your friends. Back in 1996, she made Glaad award-winning queer classic Beautiful Thing, a love story about working-class teenagers Jamie (Glen Berry) and Ste (Scott Neal), who live next door to each other on a post-war south-east London council estate.\n\nSince Beautiful Thing, Macdonald has faced a number of setbacks. As early as 1996, she was working on a film adaptation of Patricia Highsmith’s sapphic novel The Price of Salt, later adapted by Todd Haynes into 2015’s Carol, but the script was dropped. In 2001, she was said to be directing a romcom with Winona Ryder, but the actor left the project unexpectedly and it never got made. She did helm the acclaimed new miniseries Howards End, a wonderfully naturalistic adaptation scripted by Kenneth Lonergan, but Beautiful Thing remains a cinematic one-off – one that is as beautiful as its name suggests.\n\nWritten by Liverpudlian Jonathan Harvey, Beautiful Thing was originally a theatre production, which Macdonald directed for London’s Bush Theatre and its subsequent West End run. After the play won five-star reviews and a John Whiting award, Channel 4 asked Macdonald to adapt it into a film – despite the fact she’d never even been on a set before. What followed is one of the most beloved gay-youth movies of the Nineties. “This movie got me through high school,” wrote one fan on Reddit. ”It made me realise I was normal, or not normal but being not normal is normal,” said another.\n\nBeautiful Thing follows Jamie and Ste as they navigate the difficulties of growing up gay and working class in a society that rarely values anyone who is either. Ste’s drug-dealing brother beats him up. His dad is an alcoholic who makes Ste cook for him, telling his son his bubble and squeak “looks like fried s***”. Jamie’s mum Sandra (Linda Henry), a pub manager, is dating a washed-up, weed-smoking hippie half her age who says things like, “I saw a video about Woodstock once.” And at school, Jamie is bullied for being an oddball outcast who can’t play football. Next door is Leah (Tameka Empson), a young black woman who has been expelled from school and spends lots of her free time taking drugs and groaning about how “there’s f***-all to look forward to”. In this environment, it’s hard for Ste and Jamie to be happy – and that’s before anyone finds out they are gay.\n\nFollowing on from the kitchen-sink films of the late-Fifties and early-Sixties, social realism has tended to look bleak and depressing. You see this in the shadowy corners of Mike Leigh and the sparse flats of (pre-America) Andrea Arnold, where miserable greys, blues and muddy beiges mirror the fatalistic trajectories of characters left with no hope of happiness. But right from the rainbow which bends past the concrete tower blocks during the opening titles, Beautiful Thing is bursting with colour. Yellow sunflowers twist through Leah’s plaited hair. Green and purple plants crawl out of the estate’s hanging baskets and flower beds. There are mermaid-green sequins on the drag queen’s dress, which glint with the orange glow from the local gay pub.\n\nAround the time of the film’s release, Macdonald said she used colour as a way of bringing joy to the film, but that she didn’t want this detracting from the naturalistic atmosphere. “The decor is brightened, but only subtly,” she told MIT Press back in 1996, “because you still have to believe that these are real people and real lives. We needed to hang on to grittiness. It came down to little details like choosing to make the school uniforms red and not grey, choosing to decorate the flat with bright wallpaper rather than s****y stuff. Choosing to film some scenes by the lake, instead of some more sterile part of the environment. All these things together tend to heighten and brighten the realism.“\n\nPerhaps the best part of Beautiful Thing, and also Macdonald’s work on Normal People, is her deft hand for highlighting the tiny intricacies that make up intimacy. After seeing Jamie’s bruises from another fight with his brother, Ste gets him to lie down in bed while he massages his mum’s Body Shop peppermint foot lotion into his back. “Cold, innit?” Jamie smiles as Ste winces. “Have you ever kissed someone, stuck your tongue in?” he asks. The answer is no and there follows a silence while they lay next to each other in bed, until Jamie leans over and pecks him. They turn the fairy lights off, but you can see the whites of their eyes in the dark as they try and fail to fall asleep. You get the feeling they think they shouldn’t have done that. You get the feeling they want to do it again.\n\nShame changes to pride after Ste and Jamie go to a drag bar. After laughing as a queen serenades them with the words “I feel like chicken tonight”, they run through a forest on the way home to Mama Cass’s gleeful, frenetic singing: “But you gotta make your own kind of music/ Sing your own special song/ Make your own kind of music/ Even if nobody else sings along.” Jamie pushes Ste against a tree and they kiss like teenagers, both moving to different rhythms. Teeth bashing. Too much tongue. But under the navy sky and in their stomachs, it is beautiful.\n\nOne of my favourite things about Normal People is the way you can hear Connell and Marianne breathing as they have sex, loud and wobbling through their chest. Often in film, the small things that make up human interaction are washed away by grand, sepia-toned gestures. But Macdonald has a tendency to pick them up. Too-cold lotion on the skin. A hand on a shoulder. A mum’s concerned glare.\n\nNot everyone was a fan of Macdonald's work on Beautiful Thing. After seeing the play, Conservative MP for the Bexley Borough Council Graham R Holland called it “sickening”. He rallied against the play’s “sordid” language, complaining that “it was gratuitous, foul and offensive and was neither relevant nor – with my experience of Thamesmead – in any way typical of the young people with whom I am in contact.” He left with his family 20 minutes into the performance. Meanwhile, revered film critic Roger Ebert criticised the film’s drag queen sequence. After acknowledging that he had “never been a gay London teenager”, he doubted that characters like Ste and Jamie would be enamoured by “men doing Barbra Streisand imitations”. It’s a strange statement in retrospect. Of course queer people can find belonging in a wider community. They still do now.\n\nNot many gay characters have happy endings in film. They usually end up dead or unhappily married. So with the building tensions with Jamie and Ste’s family members and gossiping neighbours, you worry about the fate of the teenagers. Mercifully, it has a happy ending. Speaking of this decision, Macdonald said that Harvey had written the play because “when he was growing up in Liverpool, he never saw his experience represented anywhere on the telly or in the cinema. The only images of being gay were either Merchant/Ivory school – very posh – or if you did find a working-class gay character, they usually got thrown out of their home, went into prostitution, and died or whatever.”\n\nJamie’s mum Sandra eventually finds out about his sexuality via a Gay Times magazine under the bed, and school workbooks covered by his classmates with penises and homophobic slurs. She’s shocked at first, but then she wraps her arms around him and tells him, “I’m not going to put you out like an old bottle.” The film ends with Jamie and Ste slow dancing in the middle of the estate to Mama Cass’ 1968 chart-topper “Dream a Little Dream of Me”. Leah and Sandra join them. Some neighbours look horrified. Others’ hearts look full. Another rainbow beams down from the sunny sky. It’s a happy ending. It’s one they deserve.","source":"theindependent","published_at":"2020-05-26T04:05:00-04:00","url":"https://www.independent.co.uk/arts-entertainment/films/features/beautiful-thing-normal-people-hettie-macdonald-lgbtq-film-a9531541.html"},{"_id":"thenewyorktimes--2020-06-05--Falling Jobless Rate Could Imperil Aid Underpinning the Recovery","title":"Falling Jobless Rate Could Imperil Aid Underpinning the Recovery","content":"WASHINGTON — A $3 trillion burst of economic assistance from the federal government has fueled a faster-than-expected rebound in hiring amid the coronavirus pandemic. That bounce suggests the economy is slowly healing, but it could also encourage Republican lawmakers to shut off some aid to people and companies prematurely, undermining that very recovery.\n\nThe surprise news that the economy added 2.5 million jobs in May, with unemployment dropping to 13.3 percent, emboldened congressional Republicans who have been reluctant to extend expensive jobless benefits and small-business loans. Many economists, in stark contrast, said the rebound was predicated on federal aid and pleaded with Congress not to relent on spending that has helped keep workers employed and bolstered consumer spending amid a swift and steep recession.\n\nRepublicans have acknowledged that some sort of legislation addressing the impact of the pandemic is likely. But the numbers released Friday, aides said, vindicated their reluctance to pursue another large, sweeping package. Instead, lawmakers are looking to a more limited measure that would include new spending and focus on reopening state economies.\n\n“As Senate Republicans have made clear for weeks, future efforts must be laser-focused on helping schools reopen safely in the fall, helping American workers continue to get back on the job, and helping employers reopen and grow,” Senator Mitch McConnell of Kentucky, the majority leader, said in a statement.","source":"thenewyorktimes","published_at":"2020-06-05T22:06:00-04:00","url":"https://www.nytimes.com/2020/06/05/business/jobs-economy-recovery-aid.html"}]}